Revit 2027 API
ParameterTypeId.RampAttrMaterial Property
 "Ramp Material"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RampAttrMaterial { get; }
Public Shared ReadOnly Property RampAttrMaterial As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RampAttrMaterial {
	ForgeTypeId^ get ();
}
static member RampAttrMaterial : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace